[{"id": "CPSC 100", "name": "Computational Thinking", "ects": "3", "semester": null, "description": "Meaning and impact of computational thinking. Solving problems using computational thinking, testing, debugging. How computers work. No prior computing experience required. Not for students with existing credit for or exemption from CPSC 110 or APSC 160."},{"id": "CPSC 103", "name": "Introduction to Systematic Program Design", "ects": "3", "semester": null, "description": "Computation as a tool for systematic problem solving in non-computer-science disciplines. Introductory programming skills. Not for students with existing credit for or exemption from CPSC 110 or APSC 160. No programming experience expected."},{"id": "CPSC 121", "name": "Models of Computation", "ects": "4", "semester": null, "description": "Physical and mathematical structures of computation.  Boolean algebra and combinations logic circuits; proof techniques; functions and sequential circuits; sets and relations; finite state machines; sequential instruction execution."},{"id": "CPSC 210", "name": "Software Construction", "ects": "4", "semester": null, "description": "Design, development, and analysis of robust software components. Topics such as software design, computational models, data structures, debugging, and testing."},{"id": "CPSC 221", "name": "Basic Algorithms and Data Structures", "ects": "4", "semester": null, "description": "Design and analysis of basic algorithms and data structures; algorithm analysis methods, searching and sorting algorithms, basic data structures, graphs and concurrency."},{"id": "CPSC 298", "name": "Co-operative Work Placement I", "ects": "3", "semester": null, "description": "Approved and supervised technical work experience in the computing industry for a minimum of 3.5 months. Normally taken during Winter Session of second year. Technical report required. Restricted to students admitted to the Co-operative Education Program in Computer Science."},{"id": "CPSC 301", "name": "Computing in the Life Sciences", "ects": "3", "semester": null, "description": "Basic concepts, tools, and techniques for working with scientific data at larger scales, higher speeds, and lower costs that would otherwise be impossible. Applications and examples drawn from the life sciences. No prior computing background is required. Not for credit for students who have credit for any of the following: APSC 160, Computer Science AP, IB Computer Science, EOSC 211, or 3 credits of CPSC beyond CPSC 101."},{"id": "CPSC 303", "name": "Numerical Approximation and Discretization", "ects": "3", "semester": null, "description": "Numerical techniques for basic mathematical processes involving discretization, and their analysis. Interpolation and approximation, including splines and least squares data fitting; numerical differentiation and integration; introduction to numerical initial value ordinary differential equations."},{"id": "CPSC 310", "name": "Introduction to Software Engineering", "ects": "4", "semester": null, "description": "Specification, design, implementation and maintenance of large, multi-module software systems. Principles, techniques, methodologies and tools for computer aided software engineering (CASE); human-computer interfaces, reactive systems, hardware-software interfaces and distributed applications."},{"id": "CPSC 312", "name": "Functional and Logic Programming", "ects": "3", "semester": null, "description": "Principles of symbolic computing, using languages based upon first-order logic and the lambda calculus. Algorithms for implementing such languages. Applications to artificial intelligence and knowledge representation."},{"id": "CPSC 314", "name": "Computer Graphics", "ects": "3", "semester": null, "description": "Human vision and colour; geometric transformations; algorithms for 2-D and 3-D graphics; hardware and system architectures; shading and lighting; animation."},{"id": "CPSC 319", "name": "Software Engineering Project", "ects": "4", "semester": null, "description": "The design, implementation, and test of a large software system, using a team approach."},{"id": "CPSC 322", "name": "Introduction to Artificial Intelligence", "ects": "3", "semester": null, "description": "Problem-solving and planning; state/action models and graph searching. Natural language understanding Computational vision. Applications of artificial intelligence."},{"id": "CPSC 344", "name": "Introduction to Human Computer Interaction Methods", "ects": "3", "semester": null, "description": "Basic tools and techniques, teaching a systematic approach to interface design, task analysis, analytic and empirical evaluation methods."},{"id": "CPSC 406", "name": "Computational Optimization", "ects": "3", "semester": null, "description": "Formulation and analysis of algorithms for continuous and discrete optimization problems; linear, nonlinear, network, dynamic, and integer optimization; large-scale problems; software packages and their implementation; duality theory and sensitivity."},{"id": "CPSC 411", "name": "Introduction to Compiler Construction", "ects": "3", "semester": null, "description": "A practical introduction to lexical analysis, syntactic analysis, type-checking, code generation and optimization. This will be used to design and implement a compiler for a small language."},{"id": "CPSC 416", "name": "Distributed Systems", "ects": "3", "semester": null, "description": "Concepts and design of distributed systems. Communication architecture and models for interprocess communication. Process migration, naming, distributed file systems, fault tolerance, and concurrency control."},{"id": "CPSC 418", "name": "Parallel Computation", "ects": "3", "semester": null, "description": "Algorithms, architectures, and programming paradigms for parallel computation.  Shared memory, message passing, and data parallel architectures and programming models.  Parallel algorithms including reduce, scan, and sorting networks.  Reasoning about the correctness of parallel programs.  Performance analysis and measurement for parallel programs."},{"id": "CPSC 421", "name": "Introduction to Theory of Computing", "ects": "3", "semester": null, "description": "Characterizations of computability (using machines, languages and functions). Universality, equivalence and Church's thesis. Unsolvable problems. Restricted models of computation. Finite automata, grammars and formal languages."},{"id": "CPSC 424", "name": "Geometric Modeling", "ects": "3", "semester": null, "description": "Digital representation of curves and surfaces, including splines, subdivision surfaces and meshes. Principles, algorithms and mathematical foundations for  geometry representation in computer graphics, computer vision, fabrication, CAD/CAM, and medical imaging. Algorithms for acquisition, creation, representation, and processing of 3D shapes."},{"id": "CPSC 444", "name": "Advanced Methods for Human Computer Interaction", "ects": "3", "semester": null, "description": "Design and evaluation methodologies and theories; formal models of the user including visual, motor, and information processing; advanced evaluation methods including laboratory experiments and field studies; HCI research frontiers."},{"id": "CPSC 448B", "name": "Directed Studies in Computer Science - DIRECTED STUDIES", "ects": "3", "semester": null, "description": "Open ordinarily to students in Computer Science with at least a 72% average and the permission of the head of the department or designate. The course may consist of supervised reading, participation in a seminar, and one or more programming projects."},{"id": "CPSC 449", "name": "Honours Thesis", "ects": "6", "semester": null, "description": "Under supervision of a faculty member, students investigate a research topic and prepare a thesis."},{"id": "CPSC 501", "name": "Theory of Automata, Formal Languages and Computability", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 507", "name": "Software Engineering", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 513", "name": "Introduction to Formal Verification and Analysis", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 522", "name": "Artificial Intelligence II", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 527", "name": "Computer Communication Protocols", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 532L", "name": "Topics in Artificial Intelligence - VISION&LANGUAGE", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 532S", "name": "Topics in Artificial Intelligence - COMP NEUROSCI", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 534L", "name": "Topics in Data Management - SOCIAL & INFO NW", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 536F", "name": "Topics in Algorithms and Complexity - COMP ECON QUESTS", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 538A", "name": "Topics in Computer Systems - CONCUR&PARALLEL", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 539F", "name": "Topics in Programming Languages - SD PRODUCTIVITY", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 542G", "name": "Topics in Numerical Computation - BREADTH SCI COMP", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 547", "name": "Information Visualization", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 549B", "name": "Master's Thesis - MASTERS THESIS", "ects": "12", "semester": null, "description": ""},{"id": "CPSC 554K", "name": "Topics in Human-Computer Interaction - DESGN FOR PPL", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 554Y", "name": "Topics in Human-Computer Interaction - MULTMDAL INTRCTN", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 589", "name": "M.Sc. Major Essay", "ects": "3", "semester": null, "description": ""},{"id": "CPSC 649", "name": "Doctoral Dissertation", "ects": "0", "semester": null, "description": ""}]